## 정렬(Sort)

In [120]:
s = pd.Series(range(5), index = ['A','D','B','C','E'])
s

A    0
D    1
B    2
C    3
E    4
dtype: int64

In [121]:
s.sort_index()

A    0
B    2
C    3
D    1
E    4
dtype: int64

In [122]:
s.sort_values()

A    0
D    1
B    2
C    3
E    4
dtype: int64

In [123]:
t = pd.Series(np.random.randint(0, 10, 5), index=list('DAECB'))
t

D    6
A    2
E    9
C    3
B    4
dtype: int32

In [124]:
t.sort_index()

A    2
B    4
C    3
D    6
E    9
dtype: int32

In [125]:
t.sort_values()

A    2
C    3
B    4
D    6
E    9
dtype: int32

In [126]:
tf = pd.DataFrame(np.random.randint(0, 10, (4, 4)),
                   index = [2, 4, 1, 3],
                   columns = list('BDAC'))
tf

   B  D  A  C
2  0  6  5  9
4  8  8  1  6
1  3  6  1  9
3  3  0  4  0

In [127]:
tf.sort_index()

   B  D  A  C
1  3  6  1  9
2  0  6  5  9
3  3  0  4  0
4  8  8  1  6

In [128]:
tf.sort_index(axis=1)

   A  B  C  D
2  5  0  9  6
4  1  8  6  8
1  1  3  9  6
3  4  3  0  0

In [129]:
tf.sort_values(by='B')

   B  D  A  C
2  0  6  5  9
1  3  6  1  9
3  3  0  4  0
4  8  8  1  6

In [130]:
tf.sort_values(by=['B','A'])

   B  D  A  C
2  0  6  5  9
1  3  6  1  9
3  3  0  4  0
4  8  8  1  6

In [131]:
tf = pd.DataFrame(np.random.randint(0, 10, (4, 4)), 
                  index=['Robert', 'Daniel', 'Kim', 'Garcia'], 
                  columns=['KG','G','W','T'])
tf

        KG  G  W  T
Robert   3  9  0  9
Daniel   0  7  0  0
Kim      7  2  8  0
Garcia   1  2  0  6

In [132]:
tf.sort_index()

        KG  G  W  T
Daniel   0  7  0  0
Garcia   1  2  0  6
Kim      7  2  8  0
Robert   3  9  0  9

In [133]:
tf.sort_index(axis=1)

        G  KG  T  W
Robert  9   3  9  0
Daniel  7   0  0  0
Kim     2   7  0  8
Garcia  2   1  6  0

In [134]:
tf.sort_values(by='G')

        KG  G  W  T
Kim      7  2  8  0
Garcia   1  2  0  6
Daniel   0  7  0  0
Robert   3  9  0  9